Revit 2027 API
BuiltInFailures.FamilyFailures.FamilyValidationResult Property
 Family Validation Warning(s): [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FamilyValidationResult { get; }
Public Shared ReadOnly Property FamilyValidationResult As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FamilyValidationResult {
	FailureDefinitionId^ get ();
}
static member FamilyValidationResult : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace